import '../scss/app.scss';

/* Gallery */
import './gallery';
import './modal';
import './video-player';

console.log(`
Приветствую тебя товарищ !
Ваша оценка - 138 баллов. Не успел сделать форму...в остальном всё должно быть окей.
Не выполненные/не засчитанные пункты:
1) при вёрстке формы используются следующие элементы: form, input type="date", input type="time", input type="text", input type="email", input type="tel", input type="number", select
2) вёрстка формы соответствует макету
3) можно передвигать ползунки громкости и прогресс-бара видео, при этом цвет шкалы до и после ползунка отличается и соответствует макету
4) кнопке "Book" в форме покупки билетов добавлен ripple-эффект
`);
