import '../scss/app.scss';

/* Gallery */
import './gallery';
import './modal';
import './video-player';
import './burger-menu';
import './youtube-frame';

console.log(`
Привет) форма полностью не сделана, времени категорически не хватает, в остальном всё нормально!

Ваша оценка - 143 балла 
Отзыв по пунктам ТЗ:
Не выполненные/не засчитанные пункты:
1) Форма покупки билетов 
2) Форма покупки билетов 
3) Форма покупки билетов 

Частично выполненные пункты:
1) при клике по ссылке в адаптивном меню, или при клике по любому месту сайта, кроме самого адаптивного меню, меню закрывается 

2) Результат проверки скорости сайта для мобильных устройств: 0 to 49 (red): Poor - не выполнено 0 ,баллов; 50 to 89 (orange): Needs Improvement - частично выполнено - 4 баллов; 90 to 100 (green): Good - выполнено полностью - 8 баллов 

Выполненные пункты:
1) Блок header 
2) Секция Welcome 
3) Секция Visiting 
4) Секция Explore 
5) Секция Video 
6) Секция Gallery 
7) Секция Tickets 
8) Секция Contacts 
9) Блок footer  
10) Блок header 
11) Секция Welcome 
12) Секция Visiting 
13) Секция Explore 
14) Секция Video 
15) Секция Gallery 
16) Секция Tickets 
17) Секция Contacts 
18) Блок footer  
19) Блок header 
20) Секция Welcome 
21) Секция Visiting 
22) Секция Explore 
23) Секция Video 
24) Секция Gallery 
25) Секция Tickets 
26) Секция Contacts 
27) Блок footer  
28) Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки,  элементы не должны скрываться, обрезаться, наезжать друг на друга, если это не предусмотрено макетом. 
29) слайдера в секции Welcome 
30) слайдера сравнения изображений в секции Explore 
31) кастомного видеоплеера в секции Video 
32) слайдера в секции Video
33) YouTube-видео в плейлисте в секции Video, маленькие видео выровнены по краям большого 
34) галереи изображений и изображений в ней 
35) карты 
36) при нажатии на бургер-иконку меню появляется, плавно выдвигаясь слева, бургер-иконка изменяется на крестик. При нажатии на крестик меню исчезает, плавно возвращаясь назад, иконка крестика превращается в бургер-иконку 
37) ссылки в меню работают, обеспечивая плавную прокрутку по якорям 
38) вёрстка меню соответствует макету на всех проверяемых разрешениях 
`);
